engineer-ae3o/stm32-hal-library/components/utils/src/clock.c
#include "stm32f411xe.h"
#include "utils/common.h"
#include "utils/board.h"
#include "utils/clock.h"
#include "utils/tick.h"

#include <stdint.h>


// At startup, the HSI feeds the SYSCLK, and since there are no prescalers or divider
// active at boot, the values of the HCLK, PCLK1 and PCLK2 are equal to the HSI value
// Whereas, the audio PLL is disabled after reset.
static volatile system_clock_t s_system_core_clock_type = HSI_PLL_DIRECT;
static volatile audio_clock_t  s_audio_pll_clock_type   = AUDIO_PLL_DISABLE;

static volatile uint32_t s_system_core_clock = HSI_VALUE_Hz;
static volatile uint32_t s_apb1_core_clock   = HSI_VALUE_Hz;
static volatile uint32_t s_apb2_core_clock   = HSI_VALUE_Hz;
static volatile uint32_t s_audio_pll_clock   = 0;

// Lookup tables for the HCLK and APB prescalers
static const uint8_t s_ahb_presc_lut[16] = {0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 3, 4, 6, 7, 8, 9};
static const uint8_t s_apb_presc_lut[8]  = {0, 0, 0, 0, 1, 2, 3, 4};


typedef struct {
    // General settings
    uint32_t flash_latency; // CMSIS defined macro. See FLASH_ACR_LATENCY_xxx
    uint32_t vos_scale;     // CMSIS defined macro. See PWR_CR_VOS_xxx. Ignored if sysclk_source is RCC_CFGR_SWS_HSI or RCC_CFGR_SWS_HSE
    uint32_t sysclk_source; // CMSIS defined macro. See RCC_CFGR_SWS_xxx
    // These only have any meaning if sysclk_source is RCC_CFGR_SWS_PLL
    uint32_t pll_source; // CMSIS defined macro
    uint32_t pllm;       // Regular number. Allowed range is 2 - 63
    uint32_t plln;       // Regular number. Allowed range is 50 - 432
    uint32_t pllp;       // Regular number. Allowed values are 2, 4, 6 and 8 (encoded as 0b00, 0b01, 0b10 and 0b11 respectively)
    uint32_t pllq;       // Regular number. Allowed range is 2 - 15
    // Bus prescalers
    uint32_t ahb_prescaler;  // CMSIS defined macro. See RCC_CFGR_HPRE_DIVx
    uint32_t apb1_prescaler; // CMSIS defined macro. See RCC_CFGR_PPRE1_DIVx
    uint32_t apb2_prescaler; // CMSIS defined macro. See RCC_CFGR_PPRE2_DIVx
} system_clock_preset_t;

typedef struct {
    bool     disable; // Set to power down the audio PLL
    uint32_t plln;    // Regular number. Allowed range is 50 - 432
    uint32_t pllr;    // Regular number. Allowed range is 2 - 7
} audio_clock_preset_t;

// Tables mapping the different clock frequencies and sources to their respective configuration data
static const system_clock_preset_t s_system_clock_preset_lut[] = {
    [HSE_PLL_100MHz] =
        {
            .flash_latency  = FLASH_ACR_LATENCY_3WS,  // 3 flash wait states since the SYSCLK is at the highest value
            .vos_scale      = 0b11 << PWR_CR_VOS_Pos, // Voltage scale of 1 since high SYSCLK frequency
            .sysclk_source  = RCC_CFGR_SWS_PLL,       // SYSCLK source is the PLL
            .pll_source     = RCC_PLLCFGR_PLLSRC_HSE, // PLL source is the HSE
            .pllm           = HSE_VALUE_MHz,          // Divides the HSE by its value in MHz to give us 1MHz regardless of its starting value
            .plln           = 200,                    // Multiplies the resultant 1MHz by 200 to give 200MHz
            .pllp           = 0b00,                   // Divides the 200MHz by 2 to provide 100MHz for the SYSCLK. For more details, refer above
            .pllq           = 4,                      // Divides the 200MHz by 4 to provide 50MHz for the USB and SDIO clocks
            .ahb_prescaler  = RCC_CFGR_HPRE_DIV1,     // s_system_core_clock = SYSCLK = 100MHz
            .apb1_prescaler = RCC_CFGR_PPRE1_DIV2,    // APB1 = s_system_core_clock / 2 = 50MHz
            .apb2_prescaler = RCC_CFGR_PPRE2_DIV1,    // APB2 = s_system_core_clock = 100MHz
        },
    [HSE_PLL_96MHz] =
        {
            .flash_latency  = FLASH_ACR_LATENCY_3WS,  // 3 flash wait states since the SYSCLK is at a very high value
            .vos_scale      = 0b11 << PWR_CR_VOS_Pos, // Voltage scale of 1 since high SYSCLK frequency
            .sysclk_source  = RCC_CFGR_SWS_PLL,       // SYSCLK source is the PLL
            .pll_source     = RCC_PLLCFGR_PLLSRC_HSE, // PLL source is the HSE
            .pllm           = HSE_VALUE_MHz,          // Divides the HSE by its value in MHz to give us 1MHz regardless of its starting value
            .plln           = 192,                    // Multiplies the resultant 1MHz by 192 to give 192MHz
            .pllp           = 0b00,                   // Divides the 192MHz by 2 to provide 96MHz for the SYSCLK. For more details, refer above
            .pllq           = 4,                      // Divides the 192MHz by 4 to provide 48MHz for the USB and SDIO clocks
            .ahb_prescaler  = RCC_CFGR_HPRE_DIV1,     // s_system_core_clock = SYSCLK = 96MHz
            .apb1_prescaler = RCC_CFGR_PPRE1_DIV2,    // APB1 = s_system_core_clock / 2 = 48MHz
            .apb2_prescaler = RCC_CFGR_PPRE2_DIV1,    // APB2 = s_system_core_clock = 96MHz
        },
    [HSE_PLL_84MHz] =
        {
            .flash_latency  = FLASH_ACR_LATENCY_2WS,  // 2 flash wait states since the SYSCLK is at a fairly high value
            .vos_scale      = 0b10 << PWR_CR_VOS_Pos, // Voltage scale of 2 since fairly high SYSCLK frequency
            .sysclk_source  = RCC_CFGR_SWS_PLL,       // SYSCLK source is the PLL
            .pll_source     = RCC_PLLCFGR_PLLSRC_HSE, // PLL source is the HSE
            .pllm           = HSE_VALUE_MHz,          // Divides the HSE by its value in MHz to give us 1MHz regardless of its starting value
            .plln           = 168,                    // Multiplies the resultant 1MHz by 168 to give 168MHz
            .pllp           = 0b00,                   // Divides the 168MHz by 2 to provide 84MHz for the SYSCLK. For more details, refer above
            .pllq           = 4,                      // Divides the 168MHz by 4 to provide 42MHz for the USB and SDIO clocks
            .ahb_prescaler  = RCC_CFGR_HPRE_DIV1,     // s_system_core_clock = SYSCLK = 84MHz
            .apb1_prescaler = RCC_CFGR_PPRE1_DIV2,    // APB1 = s_system_core_clock / 2 = 42MHz
            .apb2_prescaler = RCC_CFGR_PPRE2_DIV1,    // APB2 = s_system_core_clock = 84MHz
        },
    [HSE_PLL_64MHz] =
        {
            .flash_latency  = FLASH_ACR_LATENCY_1WS,  // 1 flash wait state since the SYSCLK is at a fairly low value
            .vos_scale      = 0b01 << PWR_CR_VOS_Pos, // Voltage scale of 3 since fairly low SYSCLK frequency
            .sysclk_source  = RCC_CFGR_SWS_PLL,       // SYSCLK source is the PLL
            .pll_source     = RCC_PLLCFGR_PLLSRC_HSE, // PLL source is the HSE
            .pllm           = HSE_VALUE_MHz,          // Divides the HSE by its value in MHz to give us 1MHz regardless of its starting value
            .plln           = 128,                    // Multiplies the resultant 1MHz by 128 to give 128MHz
            .pllp           = 0b00,                   // Divides the 128MHz by 2 to provide 64MHz for the SYSCLK. For more details, refer above
            .pllq           = 4,                      // Divides the 128MHz by 4 to provide 32MHz for the USB and SDIO clocks
            .ahb_prescaler  = RCC_CFGR_HPRE_DIV1,     // s_system_core_clock = SYSCLK = 64MHz
            .apb1_prescaler = RCC_CFGR_PPRE1_DIV2,    // APB1 = s_system_core_clock / 2 = 32MHz
            .apb2_prescaler = RCC_CFGR_PPRE2_DIV1,    // APB2 = s_system_core_clock = 64MHz
        },
    [HSE_PLL_48MHz] =
        {
            .flash_latency  = FLASH_ACR_LATENCY_1WS,  // 1 flash wait state since the SYSCLK is at a low value
            .vos_scale      = 0b01 << PWR_CR_VOS_Pos, // Voltage scale of 3 since low SYSCLK frequency
            .sysclk_source  = RCC_CFGR_SWS_PLL,       // SYSCLK source is the PLL
            .pll_source     = RCC_PLLCFGR_PLLSRC_HSE, // PLL source is the HSE
            .pllm           = HSE_VALUE_MHz,          // Divides the HSE by its value in MHz to give us 1MHz regardless of its starting value
            .plln           = 96,                     // Multiplies the resultant 1MHz by 96 to give 96MHz
            .pllp           = 0b00,                   // Divides the 96MHz by 2 to provide 48MHz for the SYSCLK. For more details, refer above
            .pllq           = 2,                      // Divides the 96MHz by 2 to provide 48MHz for the USB and SDIO clocks
            .ahb_prescaler  = RCC_CFGR_HPRE_DIV1,     // s_system_core_clock = SYSCLK = 48MHz
            .apb1_prescaler = RCC_CFGR_PPRE1_DIV1,    // APB1 = s_system_core_clock  = 48MHz
            .apb2_prescaler = RCC_CFGR_PPRE2_DIV1,    // APB2 = s_system_core_clock = 48MHz
        },
    [HSE_PLL_MATCH_HSI] =
        {
            .flash_latency  = FLASH_ACR_LATENCY_0WS,  // 0 flash wait state since the SYSCLK is at a low value
            .vos_scale      = 0b01 << PWR_CR_VOS_Pos, // Voltage scale of 3 since low SYSCLK frequency
            .sysclk_source  = RCC_CFGR_SWS_PLL,       // SYSCLK source is the PLL
            .pll_source     = RCC_PLLCFGR_PLLSRC_HSE, // PLL source is the HSE
            .pllm           = HSE_VALUE_MHz,          // Divides the HSE by its value in MHz to give us 1MHz regardless of its starting value
            .plln           = HSI_VALUE_MHz * 2,      // Multiplies the resultant 1MHz by HSI_VALUE_MHz * 2
            .pllp           = 0b00, // Divides the HSI_VALUE_MHz * 2 by 2 to provide HSI_VALUE_MHz for the SYSCLK. For more details, refer above
            .pllq           = 2,    // Divides the HSI_VALUE_MHz * 2 by 2 to provide HSI_VALUE_MHz for the USB and SDIO clocks
            .ahb_prescaler  = RCC_CFGR_HPRE_DIV1,  // s_system_core_clock = SYSCLK = HSI_VALUE_MHz
            .apb1_prescaler = RCC_CFGR_PPRE1_DIV1, // APB1 = s_system_core_clock  = HSI_VALUE_MHz
            .apb2_prescaler = RCC_CFGR_PPRE2_DIV1, // APB2 = s_system_core_clock = HSI_VALUE_MHz
        },
    [HSE_PLL_DIRECT] =
        {
            .flash_latency  = FLASH_ACR_LATENCY_0WS, // 0 flash wait states since the SYSCLK frequency is very low
            .sysclk_source  = RCC_CFGR_SWS_HSE,      // SYSCLK source is the HSE
            .ahb_prescaler  = RCC_CFGR_HPRE_DIV1,    // s_system_core_clock = SYSCLK = HSE
            .apb1_prescaler = RCC_CFGR_PPRE1_DIV1,   // APB1 = s_system_core_clock = HSE
            .apb2_prescaler = RCC_CFGR_PPRE2_DIV1,   // APB2 = s_system_core_clock = HSE
        },
    [HSI_PLL_100MHz] =
        {
            .flash_latency  = FLASH_ACR_LATENCY_3WS,  // 3 flash wait states since the SYSCLK is at the highest value
            .vos_scale      = 0b11 << PWR_CR_VOS_Pos, // Voltage scale of 1 since high SYSCLK frequency
            .sysclk_source  = RCC_CFGR_SWS_PLL,       // SYSCLK source is the PLL
            .pll_source     = RCC_PLLCFGR_PLLSRC_HSI, // PLL source is the HSI
            .pllm           = HSI_VALUE_MHz,          // Divides the HSI by its value in MHz to give us 1MHz regardless of its starting value
            .plln           = 200,                    // Multiplies the resultant 1MHz by 200 to give 200MHz
            .pllp           = 0b00,                   // Divides the 200MHz by 2 to provide 100MHz for the SYSCLK. For more details, refer above
            .pllq           = 4,                      // Divides the 200MHz by 4 to provide 50MHz for the USB and SDIO clocks
            .ahb_prescaler  = RCC_CFGR_HPRE_DIV1,     // s_system_core_clock = SYSCLK = 100MHz
            .apb1_prescaler = RCC_CFGR_PPRE1_DIV2,    // APB1 = s_system_core_clock / 2 = 50MHz
            .apb2_prescaler = RCC_CFGR_PPRE2_DIV1,    // APB2 = s_system_core_clock = 100MHz
        },
    [HSI_PLL_96MHz] =
        {
            .flash_latency  = FLASH_ACR_LATENCY_3WS,  // 3 flash wait states since the SYSCLK is at a very high value
            .vos_scale      = 0b11 << PWR_CR_VOS_Pos, // Voltage scale of 1 since high SYSCLK frequency
            .sysclk_source  = RCC_CFGR_SWS_PLL,       // SYSCLK source is the PLL
            .pll_source     = RCC_PLLCFGR_PLLSRC_HSI, // PLL source is the HSI
            .pllm           = HSI_VALUE_MHz,          // Divides the HSI by its value in MHz to give us 1MHz regardless of its starting value
            .plln           = 192,                    // Multiplies the resultant 1MHz by 192 to give 192MHz
            .pllp           = 0b00,                   // Divides the 192MHz by 2 to provide 96MHz for the SYSCLK. For more details, refer above
            .pllq           = 4,                      // Divides the 192MHz by 4 to provide 48MHz for the USB and SDIO clocks
            .ahb_prescaler  = RCC_CFGR_HPRE_DIV1,     // s_system_core_clock = SYSCLK = 96MHz
            .apb1_prescaler = RCC_CFGR_PPRE1_DIV2,    // APB1 = s_system_core_clock / 2 = 48MHz
            .apb2_prescaler = RCC_CFGR_PPRE2_DIV1,    // APB2 = s_system_core_clock = 96MHz
        },
    [HSI_PLL_84MHz] =
        {
            .flash_latency  = FLASH_ACR_LATENCY_2WS,  // 2 flash wait states since the SYSCLK is at a fairly high value
            .vos_scale      = 0b10 << PWR_CR_VOS_Pos, // Voltage scale of 2 since fairly high SYSCLK frequency
            .sysclk_source  = RCC_CFGR_SWS_PLL,       // SYSCLK source is the PLL
            .pll_source     = RCC_PLLCFGR_PLLSRC_HSI, // PLL source is the HSI
            .pllm           = HSI_VALUE_MHz,          // Divides the HSI by its value in MHz to give us 1MHz regardless of its starting value
            .plln           = 168,                    // Multiplies the resultant 1MHz by 168 to give 168MHz
            .pllp           = 0b00,                   // Divides the 168MHz by 2 to provide 84MHz for the SYSCLK. For more details, refer above
            .pllq           = 4,                      // Divides the 168MHz by 4 to provide 42MHz for the USB and SDIO clocks
            .ahb_prescaler  = RCC_CFGR_HPRE_DIV1,     // s_system_core_clock = SYSCLK = 84MHz
            .apb1_prescaler = RCC_CFGR_PPRE1_DIV2,    // APB1 = s_system_core_clock / 2 = 42MHz
            .apb2_prescaler = RCC_CFGR_PPRE2_DIV1,    // APB2 = s_system_core_clock = 84MHz
        },
    [HSI_PLL_64MHz] =
        {
            .flash_latency  = FLASH_ACR_LATENCY_1WS,  // 1 flash wait state since the SYSCLK is at a fairly low value
            .vos_scale      = 0b01 << PWR_CR_VOS_Pos, // Voltage scale of 3 since fairly low SYSCLK frequency
            .sysclk_source  = RCC_CFGR_SWS_PLL,       // SYSCLK source is the PLL
            .pll_source     = RCC_PLLCFGR_PLLSRC_HSI, // PLL source is the HSI
            .pllm           = HSI_VALUE_MHz,          // Divides the HSI by its value in MHz to give us 1MHz regardless of its starting value
            .plln           = 128,                    // Multiplies the resultant 1MHz by 128 to give 128MHz
            .pllp           = 0b00,                   // Divides the 128MHz by 2 to provide 64MHz for the SYSCLK. For more details, refer above
            .pllq           = 4,                      // Divides the 128MHz by 4 to provide 32MHz for the USB and SDIO clocks
            .ahb_prescaler  = RCC_CFGR_HPRE_DIV1,     // s_system_core_clock = SYSCLK = 64MHz
            .apb1_prescaler = RCC_CFGR_PPRE1_DIV2,    // APB1 = s_system_core_clock / 2 = 32MHz
            .apb2_prescaler = RCC_CFGR_PPRE2_DIV1,    // APB2 = s_system_core_clock = 64MHz
        },
    [HSI_PLL_48MHz] =
        {
            .flash_latency  = FLASH_ACR_LATENCY_1WS,  // 1 flash wait state since the SYSCLK is at a low value
            .vos_scale      = 0b01 << PWR_CR_VOS_Pos, // Voltage scale of 3 since low SYSCLK frequency
            .sysclk_source  = RCC_CFGR_SWS_PLL,       // SYSCLK source is the PLL
            .pll_source     = RCC_PLLCFGR_PLLSRC_HSI, // PLL source is the HSI
            .pllm           = HSI_VALUE_MHz,          // Divides the HSI by its value in MHz to give us 1MHz regardless of its starting value
            .plln           = 96,                     // Multiplies the resultant 1MHz by 96 to give 96MHz
            .pllp           = 0b00,                   // Divides the 96MHz by 2 to provide 48MHz for the SYSCLK. For more details, refer above
            .pllq           = 2,                      // Divides the 96MHz by 2 to provide 48MHz for the USB and SDIO clocks
            .ahb_prescaler  = RCC_CFGR_HPRE_DIV1,     // s_system_core_clock = SYSCLK = 48MHz
            .apb1_prescaler = RCC_CFGR_PPRE1_DIV1,    // APB1 = s_system_core_clock  = 48MHz
            .apb2_prescaler = RCC_CFGR_PPRE2_DIV1,    // APB2 = s_system_core_clock = 48MHz
        },
    [HSI_PLL_MATCH_HSE] =
        {
            .flash_latency  = FLASH_ACR_LATENCY_0WS,  // 0 flash wait states since the SYSCLK is at a low value
            .vos_scale      = 0b01 << PWR_CR_VOS_Pos, // Voltage scale of 3 since low SYSCLK frequency
            .sysclk_source  = RCC_CFGR_SWS_PLL,       // SYSCLK source is the PLL
            .pll_source     = RCC_PLLCFGR_PLLSRC_HSI, // PLL source is the HSI
            .pllm           = HSI_VALUE_MHz,          // Divides the HSI by its value in MHz to give us 1MHz regardless of its starting value
            .plln           = HSE_VALUE_MHz * 2,      // Multiplies the resultant 1MHz by HSE_VALUE_MHz * 2
            .pllp           = 0b00, // Divides the HSE_VALUE_MHz * 2 by 2 to provide HSE_VALUE_MHz for the SYSCLK. For more details, refer above
            .pllq           = 2,    // Divides the HSE_VALUE_MHz * 2 by 2 to provide HSE_VALUE_MHz for the USB and SDIO clocks
            .ahb_prescaler  = RCC_CFGR_HPRE_DIV1,  // s_system_core_clock = SYSCLK = HSE_VALUE_MHz
            .apb1_prescaler = RCC_CFGR_PPRE1_DIV1, // APB1 = s_system_core_clock  = HSE_VALUE_MHz
            .apb2_prescaler = RCC_CFGR_PPRE2_DIV1, // APB2 = s_system_core_clock = HSE_VALUE_MHz
        },
    [HSI_PLL_DIRECT] =
        {
            .flash_latency  = FLASH_ACR_LATENCY_0WS, // 0 flash wait states since the SYSCLK frequency is very low
            .sysclk_source  = RCC_CFGR_SWS_HSI,      // SYSCLK source is the HSI
            .ahb_prescaler  = RCC_CFGR_HPRE_DIV1,    // s_system_core_clock = SYSCLK = HSI
            .apb1_prescaler = RCC_CFGR_PPRE1_DIV1,   // APB1 = s_system_core_clock = HSI
            .apb2_prescaler = RCC_CFGR_PPRE2_DIV1,   // APB2 = s_system_core_clock = HSI
        },
};

static const audio_clock_preset_t s_audio_clock_preset_lut[] = {
    [AUDIO_PLL_DISABLE]  = {.disable = true, .plln = 0, .pllr = 0},
    [AUDIO_PLL_76_8MHz]  = {.disable = false, .plln = 384, .pllr = 5},
    [AUDIO_PLL_135_5MHz] = {.disable = false, .plln = 271, .pllr = 2},
    [AUDIO_PLL_151MHz]   = {.disable = false, .plln = 302, .pllr = 2},
    [AUDIO_PLL_172MHz]   = {.disable = false, .plln = 344, .pllr = 2},
};

